README.org
#+TITLE: Ethan Edwards Emacs Configuration
#+AUTHOR: Ethan Carter Edwards
#+OPTIONS: toc:t
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+LATEX_HEADER: \usepackage[a4paper, left=1.5cm, right=1.5cm, top=2cm, bottom=2cm]{geometry}

This setup was highly inspired by [[https://jamiecollinson.com/blog/my-emacs-config/#footnote-1][Jamie Collinson's config]]

This is my Emacs Configuration, I've been using Emacs for a few months and I decided to go big or go home.

After a while of having it all in a single elisp file it got annoying/hard to work with.

I'm documenting it for fun, and I like notes so I'm linking to where I found each trick or configuration.

I'll also probably put this somewhere on [[https://ethancedwards.com][my site]] and update it from time to time, but the "live" version is on my [[https://gitlab.com/ethancedwards/emacs-config][gitlab]].

TODO: =toggle-truncate-lines=
TODO: Have org mode auto detect if theres a "technical" roam tag and enable =display-fill-column-indicator-mode=

#+BEGIN_QUOTE
"The Grind is not Glamorous."
- Casey Neistat
#+END_QUOTE

* Table of Contents :toc:
- [[#setup][Setup]]
  - [[#configure-package-sources-and-use-package--garbage-collection][Configure package sources and =use-package= + Garbage Collection]]
  - [[#configure-elpaca][Configure elpaca]]
  - [[#benchmark-startup][Benchmark startup]]
  - [[#find-config-function][Find config function]]
  - [[#find-main-org-file-function][Find Main org file function]]
  - [[#set-custom-settings-to-load-in-own-file][Set custom settings to load in own file]]
  - [[#add-elisp-directory-to-load-path][Add elisp directory to load-path]]
  - [[#fix-exec-path][Fix exec-path]]
- [[#preferences][Preferences]]
  - [[#turn-off-ugly-window-decoration][Turn off ugly window decoration.]]
  - [[#shorten-the-yes-or-no-prompts][Shorten the =yes or no= prompts]]
  - [[#move-all-of-the-extra-save-files-to-saves][Move all of the extra save files to ~/.saves]]
  - [[#display-line-numbers-might-change-only-to-prog-text-and-conf-mode-later][Display line numbers, might change only to prog, text, and conf mode later]]
  - [[#confirm-to-kill-emacs-whenever-not-running-in-daemon-mode][Confirm to kill Emacs whenever not running in Daemon mode]]
  - [[#just-some-user-information][Just some user information]]
  - [[#set-initial-buffer][Set initial buffer]]
  - [[#parenthesis-tweaks][Parenthesis tweaks]]
  - [[#spell-checking-with-flyspell][Spell checking with FlySpell]]
  - [[#delete-trailing-whitespace-on-save][Delete trailing whitespace on save]]
- [[#misc-keybinds][Misc. Keybinds]]
- [[#custom-elisp][Custom Elisp]]
  - [[#howard-abrams-tutorial-lisp][Howard Abram's tutorial lisp]]
  - [[#m-x-stop][=M-x stop=]]
  - [[#auto-bablel-readmeorg-after-saving][Auto bablel README.org after saving]]
  - [[#refresh-org-files][Refresh org files]]
- [[#packages][Packages]]
  - [[#keybinds][Keybinds]]
  - [[#theming-and-fontsfaces][Theming and Fonts/Faces]]
  - [[#interface][Interface]]
  - [[#general-tools][General tools]]
  - [[#programming][Programming]]
  - [[#fun-packages][Fun packages]]
- [[#applications][Applications]]
  - [[#emms][emms]]
  - [[#elpher][elpher]]

* Setup

** Configure package sources and =use-package= + Garbage Collection

Add repo's. ELPA, MELPA, org, and ublt.

#+begin_src emacs-lisp
  ;; NOTE: init.el is now generated from README.org.  Please edit that file
  ;;       in Emacs and init.el will be generated automatically!
  ;; (setq gc-cons-threshold (* 50 1000 1000))

  ;; initialize package sources
  ;; (require 'package)
  ;; (setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
  ;; 			 ("melpa" . "https://melpa.org/packages/")
  ;; 			 ("ublt" . "https://elpa.ubolonton.org/packages/")
  ;; 			 ("org" . "https://orgmode.org/elpa/")))

  ;; (package-initialize)
  ;; (unless (package-installed-p 'use-package)
  ;;   (package-refresh-contents)
  ;;   (package-install 'use-package))

  ;; (require 'use-package)
  ;; ;; (setq use-package-compute-statistics t)
  ;; (setq use-package-always-ensure t)
#+end_src

** Configure elpaca

#+begin_src emacs-lisp
  ;; install straight.el
  (defvar elpaca-installer-version 0.8)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                    ,@(when-let* ((depth (plist-get order :depth)))
                                                        (list (format "--depth=%d" depth) "--no-single-branch"))
                                                    ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  (elpaca elpaca-use-package
   ;; Enable :elpaca use-package keyword.
   (elpaca-use-package-mode)
   ;; Assume :elpaca t unless otherwise specified.
   (setq elpaca-use-package-by-default t))

  ;; Necessary to use the `:elpaca' use-package keyword at the top-level.
  (elpaca-wait)

  (elpaca elpaca-use-package
   ;; Enable :elpaca use-package keyword.
   (elpaca-use-package-mode)
   ;; Assume :elpaca t unless otherwise specified.
   (setq elpaca-use-package-by-default t))

  ;; Necessary to use the `:elpaca' use-package keyword at the top-level.
  (elpaca-wait)
#+end_src

** Benchmark startup

Benchmark's my startup, when running as daemon I won't see this message so I can view it in =*Messages*=

#+begin_src emacs-lisp
  (add-hook 'emacs-startup-hook
	    (lambda ()
	      (message "Emacs ready in %s with %d garbage collections."
		       (format "%.2f seconds"
			       (float-time
				(time-subtract after-init-time before-init-time)))
		       gcs-done)))
#+end_src

** Find config function

#+begin_src emacs-lisp
  (defun find-config ()
    "Edit README.org/init.el"
    (interactive)
    (find-file "~/.emacs.d/README.org"))

  (global-set-key (kbd "C-c I") 'find-config)
#+end_src

** Find Main org file function

#+begin_src emacs-lisp
  (defun find-main ()
    "Find index org file"
    (interactive)
    (org-roam-jump-to-index))

  ;; (global-set-key (kbd "C-c O") '(lambda () "Find index org file" (interactive) (org-roam-jump-to-index)))
  (global-set-key (kbd "C-c O") 'find-main)
#+end_src

** Set custom settings to load in own file

Stops Emacs from adding weird things to =init.el= This creates a temporary file that'll be destroyed.

#+begin_src emacs-lisp
  ;; (setq custom-file (make-temp-file "emacs-custom"))
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  ;; (setq custom-file (make-temp-file "emacs-custom.el"))
#+end_src

** Add elisp directory to load-path

I have my custom/stolen elisp code in ~/.emacs.d/lisp/. This will add that to my load path

#+begin_src emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/lisp/")
#+end_src

** Fix exec-path

#+begin_src emacs-lisp
  (add-to-list 'exec-path "~/.cargo/bin")
#+end_src

* Preferences

** Turn off ugly window decoration.

#+begin_src emacs-lisp
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (menu-bar-mode -1)
  (blink-cursor-mode -1)
#+end_src

** Shorten the =yes or no= prompts

#+begin_src emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

** Move all of the extra save files to ~/.saves

#+begin_src emacs-lisp
  (setq backup-directory-alist `(("." . "~/.saves")))
#+end_src

** Display line numbers, might change only to prog, text, and conf mode later

#+begin_src emacs-lisp
  ;; (when (version<= "26.0.50" emacs-version )
  ;;   (global-display-line-numbers-mode))

  ;; (add-hook 'prog-mode-hook 'display-line-numbers-mode)

  (dolist (mode '(text-mode-hook
		  prog-mode-hook
		  conf-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 1))))
#+end_src

** Confirm to kill Emacs whenever not running in Daemon mode

#+begin_src emacs-lisp
  (setq confirm-kill-emacs 'y-or-n-p)
#+end_src

** Just some user information

#+begin_src emacs-lisp
  (setq user-full-name "Ethan Carter Edwards"
	user-mail-address "ethan@ethancedwards.com")
#+end_src

** Set initial buffer

#+begin_src emacs-lisp
  (setq inhibit-startup-screen t) ;; disables startup screen, which means the default buffer is the scratch buffer!
#+end_src

** Parenthesis tweaks

=show-paren-mode= highlights the matching parenthesis
=electric-pair-mode= pairs any quotes, parens, brackets, etc.

#+begin_src emacs-lisp
  (show-paren-mode)
  (electric-pair-mode)
#+end_src

