README.org
** Spell checking with FlySpell

[[https://www.tenderisthebyte.com/blog/2019/06/09/spell-checking-emacs/][Pretty good guide on this]]. Plus the [[https://www.emacswiki.org/emacs/FlySpell][emacswiki page]].

#+begin_src emacs-lisp
  ;; Enable flyspell in these modes
  (dolist (hook '(text-mode-hook))
    (add-hook hook (lambda () (flyspell-mode 1))))
  ;; disable them in these modes
  (dolist (hook '(change-log-mode-hook log-edit-mode-hook))
   (add-hook hook (lambda () (flyspell-mode -1))))

  ;; Enable mouse for MacOS
  (eval-after-load "flyspell"
    '(progn
       (define-key flyspell-mouse-map [down-mouse-3] #'flyspell-correct-word)
       (define-key flyspell-mouse-map [mouse-3] #'undefined)))
#+end_src

** Delete trailing whitespace on save

#+begin_src emacs-lisp
  (add-hook 'before-save-hook #'(lambda () (delete-trailing-whitespace)))
#+end_src

* Misc. Keybinds

From the [[https://github.com/technomancy/better-defaults/blob/master/better-defaults.el][better defaults github page]]
(I'm pretty sure these get overwriteen by Swiper but its okay :) )

#+begin_src emacs-lisp
  (global-set-key (kbd "C-M-s") 'isearch-forward-regexp)
  (global-set-key (kbd "C-M-r") 'isearch-backward-regexp)
#+end_src

Enable ibuffer, this thing is amazing, wouldn't use anything else.

#+begin_src emacs-lisp
  (global-set-key (kbd "C-x C-b") 'ibuffer)
#+end_src

Keybinds to change the size of windows

#+begin_src emacs-lisp
  (global-set-key (kbd "S-C-<left>") 'shrink-window-horizontally)
  (global-set-key (kbd "S-C-<right>") 'enlarge-window-horizontally)
  (global-set-key (kbd "S-C-<down>") 'enlarge-window)
  (global-set-key (kbd "S-C-<up>") 'shrink-window)
#+end_src

Rebind C-S-v to the opposite of M-v, EVIL binds over C-v and I want this back.

#+begin_src emacs-lisp
  (global-set-key (kbd "C-S-v") 'scroll-up-command)
#+end_src

* Custom Elisp

** Howard Abram's tutorial lisp

Fun little elisp function I wrote following a Howard Abram's tutorial, nothing special.

#+begin_src emacs-lisp
  (defun my/custom-S-o-from-vim (times)
    "Inserts a newline(s) above the line conataining the cursor.
  Very Similar to S-o from Vim"
    (interactive "p")
    (save-excursion
      (move-beginning-of-line 1)
      (newline times)))

  (global-set-key (kbd "C-S-o")
		  'my/custom-S-o-from-vim)
#+end_src

** =M-x stop=

Funny little function from user =jeetelongname#5927= on Discord :)

#+begin_src emacs-lisp
  (defun stop ()
  "Proves I'm sane, not losing my sanity whatsoever"
    (interactive)
    (defvar name "*I can quit at any time*")
    (generate-new-buffer name)
    (switch-to-buffer name)
    (insert "I can stop at any time\n")
    (insert "I am in control"))
#+end_src

** Auto bablel README.org after saving

[[https://github.com/daviwil/emacs-from-scratch/blob/master/Emacs.org#auto-tangle-configuration-files][Stolen from David]] :)

#+begin_src emacs-lisp
  ;; Automatically tangle our Emacs.org config file when we save it
  (defun my/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
			(expand-file-name "~/.emacs.d/README.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
	(org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'my/org-babel-tangle-config)))
#+end_src

** Refresh org files

If I move a file agenda freaks out, so I can just run this and fix it.

The recursive agenda bit can be [[https://www.reddit.com/r/orgmode/comments/6q6cdk/adding_files_to_the_agenda_list_recursively/dkvokt1?utm_source=share&utm_medium=web2x&context=3][found here]]
#+begin_src emacs-lisp
  ;; Have org-agenda files list recursively
  (defun my/refresh-org-files ()
  	(interactive)
  	(setq org-agenda-files (apply 'append
  				      (mapcar
  				       (lambda (directory)
  					 (directory-files-recursively
  					  directory org-agenda-file-regexp))
  				       '("~/Nextcloud/Org/")))))
#+end_src

* Packages

** Keybinds

*** Leader key

I use general.el to set my "leader" key, =SPC=, or =C-SPC=.

#+begin_src emacs-lisp
  (use-package general
    :demand t
    :config
    (general-evil-setup)
    (general-auto-unbind-keys)
    (general-override-mode +1)

    (general-create-definer my/leader-key
      :states '(normal insert visual emacs treemacs)
      :keymap 'override
      :prefix "SPC"
      :global-prefix "C-SPC"
      :non-normal-prefix "C-SPC"))
  (elpaca-wait)
#+end_src

*** Leader functions

Here I can define functions with my leader key.

#+begin_src emacs-lisp
  (my/leader-key
  	"SPC"  '(counsel-find-file :wk "counsel find file")
  	"I" '(find-config :wk "edit README.org/init.el")
  	"O" '(find-main :wk "edit index/main org file")
  	"." '(counsel-M-x :wk "M-x")
  	"b" '(:ignore t :wk "buffer")
  	"b k" '(kill-buffer :wk "kill buffer")
  	"b b" '(switch-to-buffer :wk "switch buffer")
  	"b B" '(ibuffer :wk "all buffers"))
#+end_src

*** Which-key

#+begin_src emacs-lisp
  (use-package which-key
    :init (which-key-mode)
    :config
    (setq which-key-idle-delay 5))
#+end_src

** Theming and Fonts/Faces

*** Fonts/Faces

JetBrains Mono Font, my favorite, I see no reason to use anything else.

#+begin_src emacs-lisp
  (set-face-attribute 'default nil :inherit nil :stipple nil :inverse-video nil :box nil :strike-through nil :overline nil :underline nil :slant 'normal :weight 'normal :height 98 :width 'normal :foundry "JB  " :family "JetBrains Mono")

  (when (string= system-type "darwin")
    (set-face-attribute 'default nil :inherit nil :stipple nil :inverse-video nil :box nil :strike-through nil :overline nil :underline nil :slant 'normal :weight 'normal :height 130 :width 'normal :foundry "JB  " :family "JetBrains Mono"))

  (when (string= system-name "navidad")
    (set-face-attribute 'default nil :inherit nil :stipple nil :inverse-video nil :box nil :strike-through nil :overline nil :underline nil :slant 'normal :weight 'normal :height 130 :width 'normal :foundry "JB  " :family "JetBrains Mono"))
#+end_src

Not super sure what these are, I'm going to comment them out for now...

#+begin_src emacs-lisp
  (setq ansi-color-faces-vector
    [default default default italic underline success warning error])
  (setq ansi-color-names-vector
    ["black" "#d55e00" "#009e73" "#f8ec59" "#0072b2" "#cc79a7" "#56b4e9" "white"])
#+end_src

*** Themes

The doom themes are really nice, I might switch back to the =deeper-blue= theme .

#+Begin_src emacs-lisp
  (use-package spacegray-theme :defer t)
  (use-package doom-themes
    :defer t
    :init (load-theme 'doom-palenight t))
#+end_src

*** Modeline

Powerline modeline, has everything I need, I might switch to doom-modeline

#+begin_src emacs-lisp
  (use-package powerline
    :config
    (powerline-default-theme))
#+end_src

** Interface

This is the packages that integrate with my workflow, Ivy, Evil, Magit, Org stuff, etc.

*** ESC Cancels all

Don't know if I'll use it, maybe it'll work for =C-[=, if it doesn't then I don't feel like fixing this.

#+begin_src emacs-lisp
      (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

*** Rebind C-u

Rebind =C-u= to evil stuffz, so I need to rebind =universal-argument= command to another key, =C-S-u=

#+begin_src emacs-lisp
  (global-set-key (kbd "C-S-u") 'universal-argument)
#+end_src

*** Evil Mode

Evil mode emulates Vi/Vim keybinds for Emacs

#+begin_src emacs-lisp
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-respect-visual-line-mode t)
    :config
    (evil-mode 1))

  (my/leader-key
  	"w"   '(:ignore t :wk "window")
  	"w h" '(evil-window-left :wk "move to left window")
  	"w j" '(evil-window-down :wk "move to down window")
  	"w k" '(evil-window-up :wk "move to up window")
  	"w l" '(evil-window-right :wk "move to right window")
  	"w c" '(evil-window-delete :wk "close window")
  	"w v" '(evil-window-vsplit :wk "split window vertically")
  	"w s" '(evil-window-split :wk "split window horizontally")
  	"w o" '(delete-other-windows :wk "delete other windows")
  	"TAB" '(evil-switch-to-windows-last-buffer :wk "switch to previous buffer"))
#+end_src

Evil-collection adds Evil binds to the rest of Emacs

#+begin_src emacs-lisp
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
#+end_src

Evil-commentary adds better commenting functionality to evil, =gcc= comments out any line.

#+begin_src emacs-lisp
  (use-package evil-commentary
    :after evil
    :config
    (evil-commentary-mode))
#+end_src

Evil-org adds evil functionality to org mode, very helpful

#+begin_src emacs-lisp
  (fset 'evil-redirect-digit-argument 'ignore) ;; before evil-org loaded

  (use-package evil-org
    :after org
    :config
    (add-hook 'org-mode-hook 'evil-org-mode)
    (add-hook 'evil-org-mode-hook
	      (lambda ()
		(evil-org-set-key-theme)))
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))

  ;; https://github.com/Somelauw/evil-org-mode/issues/93
  ;; (add-to-list 'evil-digit-bound-motions 'evil-org-beginning-of-line)
  ;; (evil-define-key 'motion 'evil-org-mode
  ;;     (kbd "0") 'evil-org-beginning-of-line)
#+end_src

*** Dired

Dired is a file manager built into Emacs, its pretty great.

#+begin_src emacs-lisp
  (use-package dired
    :elpaca nil
    :config
    (when (string= system-type "darwin")
      (setq dired-use-ls-dired nil)))

    (my/leader-key
      "e" '(dired-jump :wk "dired")
      "E" '(dired :wk "dired"))
#+end_src

**** dired-subtree

This allows me to have subtree views in dired

#+begin_src emacs-lisp
  (use-package dired-subtree
	  :bind (:map dired-mode-map
		      ("<tab>" . dired-subtree-toggle)
		      ("<backtab>" . dired-subtree-cycle)))
#+end_src

