init.el

;; Enable flyspell in these modes
(dolist (hook '(text-mode-hook))
  (add-hook hook (lambda () (flyspell-mode 1))))
;; disable them in these modes
(dolist (hook '(change-log-mode-hook log-edit-mode-hook))
 (add-hook hook (lambda () (flyspell-mode -1))))

;; Enable mouse for MacOS
(eval-after-load "flyspell"
  '(progn
     (define-key flyspell-mouse-map [down-mouse-3] #'flyspell-correct-word)
     (define-key flyspell-mouse-map [mouse-3] #'undefined)))

(add-hook 'before-save-hook #'(lambda () (delete-trailing-whitespace)))

(global-set-key (kbd "C-M-s") 'isearch-forward-regexp)
(global-set-key (kbd "C-M-r") 'isearch-backward-regexp)

(global-set-key (kbd "C-x C-b") 'ibuffer)

(global-set-key (kbd "S-C-<left>") 'shrink-window-horizontally)
(global-set-key (kbd "S-C-<right>") 'enlarge-window-horizontally)
(global-set-key (kbd "S-C-<down>") 'enlarge-window)
(global-set-key (kbd "S-C-<up>") 'shrink-window)

(global-set-key (kbd "C-S-v") 'scroll-up-command)

(defun my/custom-S-o-from-vim (times)
  "Inserts a newline(s) above the line conataining the cursor.
Very Similar to S-o from Vim"
  (interactive "p")
  (save-excursion
    (move-beginning-of-line 1)
    (newline times)))

(global-set-key (kbd "C-S-o")
		  'my/custom-S-o-from-vim)

(defun stop ()
"Proves I'm sane, not losing my sanity whatsoever"
  (interactive)
  (defvar name "*I can quit at any time*")
  (generate-new-buffer name)
  (switch-to-buffer name)
  (insert "I can stop at any time\n")
  (insert "I am in control"))

;; Automatically tangle our Emacs.org config file when we save it
(defun my/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
			(expand-file-name "~/.emacs.d/README.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
	(org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'my/org-babel-tangle-config)))

;; Have org-agenda files list recursively
(defun my/refresh-org-files ()
	(interactive)
	(setq org-agenda-files (apply 'append
				      (mapcar
				       (lambda (directory)
					 (directory-files-recursively
					  directory org-agenda-file-regexp))
				       '("~/Nextcloud/Org/")))))

(use-package general
  :demand t
  :config
  (general-evil-setup)
  (general-auto-unbind-keys)
  (general-override-mode +1)

  (general-create-definer my/leader-key
    :states '(normal insert visual emacs treemacs)
    :keymap 'override
    :prefix "SPC"
    :global-prefix "C-SPC"
    :non-normal-prefix "C-SPC"))
(elpaca-wait)

(my/leader-key
	"SPC"  '(counsel-find-file :wk "counsel find file")
	"I" '(find-config :wk "edit README.org/init.el")
	"O" '(find-main :wk "edit index/main org file")
	"." '(counsel-M-x :wk "M-x")
	"b" '(:ignore t :wk "buffer")
	"b k" '(kill-buffer :wk "kill buffer")
	"b b" '(switch-to-buffer :wk "switch buffer")
	"b B" '(ibuffer :wk "all buffers"))

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 5))

(set-face-attribute 'default nil :inherit nil :stipple nil :inverse-video nil :box nil :strike-through nil :overline nil :underline nil :slant 'normal :weight 'normal :height 98 :width 'normal :foundry "JB  " :family "JetBrains Mono")

(when (string= system-type "darwin")
  (set-face-attribute 'default nil :inherit nil :stipple nil :inverse-video nil :box nil :strike-through nil :overline nil :underline nil :slant 'normal :weight 'normal :height 130 :width 'normal :foundry "JB  " :family "JetBrains Mono"))

(when (string= system-name "navidad")
  (set-face-attribute 'default nil :inherit nil :stipple nil :inverse-video nil :box nil :strike-through nil :overline nil :underline nil :slant 'normal :weight 'normal :height 130 :width 'normal :foundry "JB  " :family "JetBrains Mono"))

(setq ansi-color-faces-vector
  [default default default italic underline success warning error])
(setq ansi-color-names-vector
  ["black" "#d55e00" "#009e73" "#f8ec59" "#0072b2" "#cc79a7" "#56b4e9" "white"])

(use-package spacegray-theme :defer t)
(use-package doom-themes
  :defer t
  :init (load-theme 'doom-palenight t))

(use-package powerline
  :config
  (powerline-default-theme))

(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(global-set-key (kbd "C-S-u") 'universal-argument)

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-respect-visual-line-mode t)
  :config
  (evil-mode 1))

(my/leader-key
	"w"   '(:ignore t :wk "window")
	"w h" '(evil-window-left :wk "move to left window")
	"w j" '(evil-window-down :wk "move to down window")
	"w k" '(evil-window-up :wk "move to up window")
	"w l" '(evil-window-right :wk "move to right window")
	"w c" '(evil-window-delete :wk "close window")
	"w v" '(evil-window-vsplit :wk "split window vertically")
	"w s" '(evil-window-split :wk "split window horizontally")
	"w o" '(delete-other-windows :wk "delete other windows")
	"TAB" '(evil-switch-to-windows-last-buffer :wk "switch to previous buffer"))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(use-package evil-commentary
  :diminish
  :after evil
  :config
  (evil-commentary-mode))

(fset 'evil-redirect-digit-argument 'ignore) ;; before evil-org loaded

(use-package evil-org
  ;; :diminish evil-org
  :after org
  :config
  (add-hook 'org-mode-hook 'evil-org-mode)
  (add-hook 'evil-org-mode-hook
	      (lambda ()
		(evil-org-set-key-theme)))
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

;; https://github.com/Somelauw/evil-org-mode/issues/93
;; (add-to-list 'evil-digit-bound-motions 'evil-org-beginning-of-line)
;; (evil-define-key 'motion 'evil-org-mode
;;     (kbd "0") 'evil-org-beginning-of-line)

(use-package dired
  :elpaca nil
  :config
  (when (string= system-type "darwin")
    (setq dired-use-ls-dired nil)))

  (my/leader-key
    "e" '(dired-jump :wk "dired")
    "E" '(dired :wk "dired"))

(use-package dired-subtree
	  :bind (:map dired-mode-map
		      ("<tab>" . dired-subtree-toggle)
		      ("<backtab>" . dired-subtree-cycle)))

(use-package org
  :custom
