README.org
*** Org mode

Org mode is literally the best, I'm writing this config in org, what else do you need? EDIT. No longer using org mode.

#+begin_src emacs-lisp
  (use-package org
    :custom
    (org-directory "~/Nextcloud/org")
    (diary-file "~/Nextcloud/Org/emacs-diary")
    (org-default-notes-file "~/Nextcloud/Org/Notes.org")
    (org-log-done t)
    (org-agenda-include-diary t)
    (org-image-actual-width nil)
    :bind (("C-c L" . org-stored-link)
	   ("C-c a" . org-agenda)
	   ("C-c c" . org-capture))
    :config
    (eval-after-load "org"
      '(require 'ox-md nil t))
    (eval-after-load "org"
      '(require 'org-tempo))
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))

    (my/refresh-org-files))

    (my/leader-key
	"n r" '(my/refresh-org-files :wk "refresh my org files")
	"n a" '(org-agenda :wk "org agenda"))
#+end_src

toc-org allows me to generate a toc at the top of my lifes.

#+begin_src emacs-lisp
  (use-package toc-org
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

*** Terminal modes

**** vterm

I use vterm for the cases when I need a terminal emulator, I try to use eshell as much as possible.

#+begin_src emacs-lisp
  (use-package vterm
    :custom
    (vterm-always-compile-module t)
    ;; https://github.com/akermu/emacs-libvterm/issues/525
    :bind (("C-x v" . (lambda () (interactive) (vterm t)))
	   ("C-x 4 v" . vterm-other-window)
	   :map vterm-mode-map
	   ("<C-backspace>" . (lambda () (interactive) (vterm-send-meta-backspace)))))
	   ;; came up with this myself, fixes C-backspace, pretty proud of it not going to lie :)
  (my/leader-key
	"v v" '((lambda () (interactive) (vterm t)) :wk "vterm"))
#+end_src

**** eshell

Eshell is probably my favorite shell for Emacs, its fast and just works :tm:

eshell-git-prompt gives me a git prompt for eshell, kinda in the name xD

#+begin_src emacs-lisp
  (use-package eshell-git-prompt)
  (elpaca-wait)

  (use-package eshell
    ;; :ensure nil
    :elpaca nil
    :custom (eshell-aliases-file "~/.emacs.d/eshell/eshell-alias")
    :config
    (with-eval-after-load 'esh-opt
      (setq eshell-destory-buffer-when-process-dies t)
      (setq eshell-visual-commands '("htop" "iotop")))

    (eshell-git-prompt-use-theme 'powerline))

    (my/leader-key
  	"v e" '(eshell :wk "eshell"))
#+end_src

*** Completion framework(s)

**** Ivy

I use Ivy, it's a completion framework for Emacs, I'm in the process of learning how to configure mine.
This is the initial setup of Ivy, this is bound to change drastically over time.

#+begin_src emacs-lisp
  (use-package ivy
    :custom (ivy-initial-inputs-alist nil)
    :bind (("C-s" . counsel-grep-or-swiper)
           ("C-S-s" . swiper)
	   :map ivy-minibuffer-map
	   ("TAB" . ivy-alt-done)
	   ("C-j" . ivy-next-line)
	   ("C-k" . ivy-previous-line)
	   :map ivy-switch-buffer-map
	   ("C-k" . ivy-previous-line)
	   ("C-j" . ivy-next-line)
	   ("C-d" . ivy-switch-buffer-kill))
    :config
    (ivy-mode 1))
#+end_src

**** Ivy Rich

Ivy Rich provides a nicer interface to Ivy in my opinion.

#+begin_src emacs-lisp
  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))
#+end_src

**** Counsel

Counsel takes Ivy further.

#+begin_src emacs-lisp
  (use-package counsel
    :bind (("C-x j" . 'counsel-switch-buffer)
	   :map minibuffer-local-map
	   ("C-r" . 'counsel-minibuffer-history))
    :config
    (counsel-mode 1))
#+end_src

** General tools

These are some general tools that I use, they don't really belong in any category.

*** Rainbow-mode
#+begin_src emacs-lisp
  (use-package rainbow-mode
    :hook
    ((org-mode prog-mode) . rainbow-mode))
#+end_src

*** Rainbow-delimiters
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

*** Helpful - better help buffer
#+begin_src emacs-lisp
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

  (my/leader-key
      "h" '(:ignore t :wk "helpful")
      "h f" '(counsel-describe-function :wk "describe function")
      "h v" '(counsel-describe-variable :wk "describe variable")
      "h k" '(helpful-key :wk "describe keybind"))
#+end_src

*** Hl-TODO - highlight TODO keywords and the like
#+begin_src emacs-lisp
  (use-package hl-todo
    :config
    (global-hl-todo-mode))
#+end_src

*** exec-path-from-shell - enable $PATH on MacOSX

#+begin_src emacs-lisp
  ;; only install when on macos
  (when (string= system-type "darwin")
    (use-package exec-path-from-shell
      :config
      (when (memq window-system '(mac ns))
	(exec-path-from-shell-initialize))
      (when (daemonp)
	(exec-path-from-shell-initialize))
      ))
#+end_src

*** envrc - emacs direnv integration

#+begin_src emacs-lisp
  (use-package envrc
   :init
   (envrc-global-mode))
#+end_src

*** debbugs - access the gnu bug tracker form inside emacs

#+begin_src emacs-lisp
  (use-package debbugs)
#+end_src

** Programming

*** company-mode

#+begin_src emacs-lisp
  (use-package company
    :config
    (company-tng-mode 0)
    :custom (company-minimum-prefix-length 2)
    :bind (:map company-active-map
  		("<tab>" . company-complete-selection))
  	  (:map lsp-mode-map
  		("<tab>" . company-indent-or-complete-common)))
#+end_src

*** flycheck-mode

#+begin_src emacs-lisp
  (use-package flycheck
    :init (global-flycheck-mode))
#+end_src

*** haskell-mode

#+begin_src emacs-lisp
  (use-package haskell-mode)
#+end_src

*** markdown-mode

#+begin_src emacs-lisp
  (use-package markdown-mode)
#+end_src

** Fun packages

These packages are kinda fun, don't really have much of a point

*** Elcord - Discord rich presence
#+begin_src emacs-lisp
  (use-package elcord
    :defer t)
#+end_src

*** Spotify - Control the Spotify app in emacs

#+begin_src emacs-lisp
  (use-package spotify
    :defer t)

  (my/leader-key
      "a" '(:ignore t :wk "applications")
      "a s SPC" '(spotify-playpause :wk "play-pause")
      "a s n" '(spotify-next :wk "spotify next")
      "a s p" '(spotify-previous :wk "spotify previous")
      "a s c" '(spotify-current :wk "spotify current song"))
#+end_src

*** Chess - play chess inside of Emacs!
#+Begin_src emacs-lisp
  (use-package chess
    :defer t)
#+end_src

*** gnugo - Play GO inside of Emacs!
#+begin_src emacs-lisp
  (use-package gnugo
    :defer t)
#+end_src

*** snow.el - Let it snow in Emacs!

#+begin_src emacs-lisp
  (use-package snow
    :defer t)
#+end_src

* Applications

** emms

EMMS is a Music player/interface for Emacs. I've heard good things about it and I'm willing to try it out.

#+begin_src emacs-lisp
  (use-package emms
    :commands emms
    :config
    (emms-standard)
    (emms-default-players))
#+end_src

** elpher

elpher is a gemini and gopher client for emacs.

#+begin_src emacs-lisp
  (use-package elpher)
#+end_src
