init.el
  (org-directory "~/Nextcloud/org")
  (diary-file "~/Nextcloud/Org/emacs-diary")
  (org-default-notes-file "~/Nextcloud/Org/Notes.org")
  (org-log-done t)
  (org-agenda-include-diary t)
  (org-image-actual-width nil)
  :bind (("C-c L" . org-stored-link)
	   ("C-c a" . org-agenda)
	   ("C-c c" . org-capture))
  :config
  (eval-after-load "org"
    '(require 'ox-md nil t))
  (eval-after-load "org"
    '(require 'org-tempo))
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))

  (my/refresh-org-files))

  (my/leader-key
	"n r" '(my/refresh-org-files :wk "refresh my org files")
	"n a" '(org-agenda :wk "org agenda"))

(use-package toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))

(use-package vterm
  :custom
  (vterm-always-compile-module t)
  ;; https://github.com/akermu/emacs-libvterm/issues/525
  :bind (("C-x v" . (lambda () (interactive) (vterm t)))
	   ("C-x 4 v" . vterm-other-window)
	   :map vterm-mode-map
	   ("<C-backspace>" . (lambda () (interactive) (vterm-send-meta-backspace)))))
	   ;; came up with this myself, fixes C-backspace, pretty proud of it not going to lie :)
(my/leader-key
	"v v" '((lambda () (interactive) (vterm t)) :wk "vterm"))

(use-package eshell-git-prompt)
(elpaca-wait)

(use-package eshell
  ;; :ensure nil
  :elpaca nil
  :custom (eshell-aliases-file "~/.emacs.d/eshell/eshell-alias")
  :config
  (with-eval-after-load 'esh-opt
    (setq eshell-destory-buffer-when-process-dies t)
    (setq eshell-visual-commands '("htop" "iotop")))

  (eshell-git-prompt-use-theme 'powerline))

  (my/leader-key
	"v e" '(eshell :wk "eshell"))

(use-package counsel
  :bind (("C-x j" . 'counsel-switch-buffer)
	   :map minibuffer-local-map
	   ("C-r" . 'counsel-minibuffer-history))
  :config
  (counsel-mode 1))

(use-package ivy
  :diminish
  :custom (ivy-initial-inputs-alist nil)
  :bind (("C-s" . counsel-grep-or-swiper)
         ("C-S-s" . swiper)
	   :map ivy-minibuffer-map
	   ("TAB" . ivy-alt-done)
	   ("C-j" . ivy-next-line)
	   ("C-k" . ivy-previous-line)
	   :map ivy-switch-buffer-map
	   ("C-k" . ivy-previous-line)
	   ("C-j" . ivy-next-line)
	   ("C-d" . ivy-switch-buffer-kill))
  :config
  (ivy-mode 1))

(use-package ivy-rich
  :init
  (ivy-rich-mode 1))

(use-package rainbow-mode
  :config
  ;; (setq rainbow-x-colors nil)
  (add-hook 'prog-mode-hook 'rainbow-mode))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(my/leader-key
    "h" '(:ignore t :wk "helpful")
    "h f" '(counsel-describe-function :wk "describe function")
    "h v" '(counsel-describe-variable :wk "describe variable")
    "h k" '(helpful-key :wk "describe keybind"))

(use-package rg
  :defer t)

(use-package hl-todo
  :config
  (global-hl-todo-mode))

;; only install when on macos
(when (string= system-type "darwin")
  (use-package exec-path-from-shell
    :config
    (when (memq window-system '(mac ns))
	(exec-path-from-shell-initialize))
    (when (daemonp)
	(exec-path-from-shell-initialize))
    ))

(use-package envrc
 :init
 (envrc-global-mode))

(use-package debbugs)

(use-package company
  :config
  (company-tng-mode 0)
  :custom (company-minimum-prefix-length 2)
  :bind (:map company-active-map
		("<tab>" . company-complete-selection))
	  (:map lsp-mode-map
		("<tab>" . company-indent-or-complete-common)))

(use-package elcord
  :defer t)

(use-package spotify
  :defer t)

(my/leader-key
    "a" '(:ignore t :wk "applications")
    "a s SPC" '(spotify-playpause :wk "play-pause")
    "a s n" '(spotify-next :wk "spotify next")
    "a s p" '(spotify-previous :wk "spotify previous")
    "a s c" '(spotify-current :wk "spotify current song"))

(use-package chess
  :defer t)

(use-package gnugo
  :defer t)

(use-package snow
  :defer t)

(use-package emms
  :commands emms
  :config
  (emms-standard)
  (emms-default-players))

(use-package elpher)
